app/views/messages/_group.html.haml

  .group
    %p.group__group-name テスト用グループ
---
SELECT `groups`.* FROM `groups`