app/views/shared/_group.html.haml

SELECT  `messages`.* FROM `messages` WHERE `messages`.`group_id` = 1 ORDER BY `messages`.`id` DESC LIMIT 1
---
  =link_to "#{group.name}", group_messages_path(group), class: "group__group-name"
  %p.group__latest-message=group.show_last_message