app/controllers/groups_controller.rb

SELECT `groups`.* FROM `groups`
---
  def index
    @groups = Group.all

INSERT INTO `group_users` (`user_id`, `group_id`, `created_at`, `updated_at`) VALUES (1, 2, '2019-07-14 14:12:05', '2019-07-14 14:12:05')
INSERT INTO `groups` (`name`, `created_at`, `updated_at`) VALUES ('team racoon', '2019-07-14 14:12:05', '2019-07-14 14:12:05')
---
  def new
    @group = Group.new
    # @groupと関連しているusersの配列にcurrent_userを加える
    # この下の行の記述がない場合、current_userのボックスにチェックが入らない
    @group.users << current_user

INSERT INTO `groups` (`name`, `created_at`, `updated_at`) VALUES ('シングルたぬき', '2019-07-14 15:24:38', '2019-07-14 15:24:38')
---
  def create
    @group = Group.new(group_params)
    if @group.save

UPDATE `groups` SET `name` = 'たぬきの一族', `updated_at` = '2019-07-14 14:59:49' WHERE `groups`.`id` = 1
---
  def update
    if @group.update(group_params)