app/controllers/messages_controller.rb

SELECT `users`.* FROM `users` INNER JOIN `group_users` ON `users`.`id` = `group_users`.`user_id` WHERE `group_users`.`group_id` = 1
SELECT `messages`.* FROM `messages`
---
  def index
    @message = @group.messages.new
    @messages = @group.messages.all.includes(:user)

INSERT INTO `messages` (`text`, `created_at`, `updated_at`, `group_id`, `user_id`) VALUES ('メッセージを送るよ', '2019-07-24 23:09:54', '2019-07-24 23:09:54', 1, 1)
---
  def create
    @message = @group.messages.new(message_params)
    # binding.pry
    if @message.save