app/controllers/users_controller.rb

UPDATE `users` SET `name` = 'たぬたぬ', `updated_at` = '2019-07-09 12:34:45' WHERE `users`.`id` = 1
---
  def update
    if current_user.update(user_params)